# Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным.
# Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

import itertools

for el in itertools.count(3):
    print(el, ' ', end='')
    if el == 10:
        break
print()

count = 32
for el in itertools.cycle("0123456789ABCDEF"):
    print(el, ' ', end='')
    count -= 1
    if count == 0:
        break
print()
